// ; ставить необязательно

// alert("Внимание!")

// Переменная - это область памяти, у которой есть имя и которая хранит информация

// Создание переменной
// var a = 10;
// let text = "Привет, мир";

// alert(text)

// Number - целые числа
// let number = 1000; //10, 564768796574, 0, -32453635

// // Float - числа с плавающей точкой - дробные числа
// let number_float = 535.189

// // String - строка
// let text = 'hello';
// let word = "table";

// let money = 200_000_000;
// alert(`У меня ${money} рублей`) //Работает только с обратными ковычками!

// Boolean - булевый тип
// true - истина
// false - ложь
// let example_1 = true;
// let example_2 = false;
// let isGreater = 100>20;
// alert(isGreater)
// document.write(isGreater) //Написание текста на документе

// Функции
// 1) alert() - тревога
// 2) prompt() - запросить
// let answer = prompt("Как у тебя дела?")
// alert(answer)

// 3) сonfirm() - подтвердить
// Можно ответить либо true, либо false
// let answer = confirm("Ты будешь ужинать?")
// alert(answer)

// 1
// Окно спрашивает имя
// Далее появляется окно с текстом
// "Привет, (введённое имя)"

// 2
// Окно 1: Введите номер телефона: _____
// Окно 2: Введите сумму платежа: _____
// Окно 3: На номер ____ поступила сумма ______
// Окно 4: Баланс: 1000 + _____

// 1
let name = prompt("Как тебя зовут?")
alert(`Привет, ${name}`)




